{"documentList":[{"projectName":"Project Portfolio","text":"First single page application with Angular 5 and TypeScript. Simple design allows admin to upload projects and coursework to be viewed by users. Users are able to filter/sort/search/view the projects. https://github.com/johnsonj561/Project-Portfolio 1/1/2017  Project scaffolding generated by angular-cli Admin sessions tracked with JSON Web Tokens Express server and API running on Node.js MongoDB data storage Running on Amazon AWS EC2SPA SPA SPA Angular Angular Angular Node.js Node.js Node.js Express Express Express MongoDB MongoDB MongoDB TypeScript TypeScript TypeScript AWS AWS AWS Project Portfolio Project Portfolio Project Portfolio Project Portfolio Project Portfolio "},{"projectName":"Document Summarization with K Means","text":"A 10 sentence summary was generated from a original document containing 850 sentences with machine learning techniques. Once pre-processed, Python's Natural Language Toolkit (NLTK) was used to cluster the document into 10 groups with the K Means Algorithm. From each of the 10 clusters, the centroid was identified and extracted through use of cosine similarity measurements. Finally, the 10 resulting sentences were combined to produce a 10 sentence document summary. https://github.com/johnsonj561/K-Means-Document-Summarization 12/1/2017 Information Retrieval Tokenize, stem, stop word each sentence Cluster sentences into 10 groups using K Means clustering by NLTK Calculate the cosine similarity matrix for all sentence pairs in a given cluster, yielding 10 matrices, 1 per cluster For each Cosine Similarity matrix, Sum scores of each row to determine which row (sentence) has highest similarity with the most documents Return the sentence from each cluster that has highest similarity with other sentences of the cluster (returned by step 5)  Combine all 10 resulting high similarity sentences into 1 paragraph, which is to become the summary Sort the summary's sentences in the order that they appear in the original document, to maintain positional relationships of original document Return summaryMachine Learning Machine Learning Machine Learning K Means K Means K Means Clustering Clustering Clustering Python Python Python NLTK NLTK NLTK Cosine Similarity Cosine Similarity Cosine Similarity Document Summarization with K Means Document Summarization with K Means Document Summarization with K Means Document Summarization with K Means Document Summarization with K Means "}]}
