[{
	"_id": {
		"$oid": "5a4af0a89b492a100a3fa8f2"
	},
	"description": "This course teaches concepts, techniques, and popular tools and applications in information retrieval\n(IR), which aims to obtain relevant information from a collection of resources. The class will cover efficient text indexing,\ntext processing, web search, and text mining. New applications will also be introduced.",
	"year": "2017",
	"semester": "Fall",
	"title": "Information Retrieval",
	"topics": [
		"Text pre-processing techniques (stop words, stemming, etc)",
		"TF-IDF",
		"Cosine Similarity",
		"Text Classification with machine learning techniques",
		"Document summarization with clustering"
	],
	"__v": 2
},
{
	"_id": {
		"$oid": "5a52cb4f892d280c9ec6de9e"
	},
	"description": "There are two parts to this course: Platform independent mobile phone app development; and addition of\nsemantic annotations to improve user experience and productivity. The text book uses an app-centric development methodology using HTML5, JavaScript, jQuery, jQuery Mobile, NoSQL/SQL databases, Node.js, and JSON. The result are apps that run across all mobile platforms (Android, iOS, Microsoft, and others).",
	"year": "2017",
	"semester": "Spring",
	"title": "Semantic Web Applications",
	"topics": [
		"HTML5",
		"JavaScript",
		"jQuery",
		"NoSQL vs SQL",
		"Node.js",
		"MongoDB",
		"JSON",
		"Express for Node.js",
		"AngularJS"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a52cd38892d280c9ec6de9f"
	},
	"title": "Theory and Philosophy of Computation",
	"description": "Study of major topics in the theory of computation and mathematical logic, such as Church’s thesis,\nGödel’s incompleteness theorems, and the theory of recursively enumerable sets, and their philosophical\ninterpretations.",
	"semester": "Fall",
	"topics": [
		"Turing Machines",
		"Complexity Classes P, NP, NP-Complete",
		"Church-Turing Thesis",
		"Godel's Incompleteness Theorem",
		"Cook-Levin Theorem",
		"NP-Complete membership proofs by reduction",
		"Uncomputable problems \u0026 The Halting Problem"
	],
	"year": "2017",
	"__v": 1
},
{
	"_id": {
		"$oid": "5a52ceb68214980ce181be23"
	},
	"description": "Brief introduction to Java; software development process; functional specification\nand use cases; Unified Modeling Language diagrams; design methodology; OO design principles;\nimplementation in Java; design patterns; Java applet framework; advanced Java topics: reflection,\nserialization, multithreading, generics. For the term project students will implement a real-world\napplication passing through all software development stages. ",
	"year": "2017",
	"semester": "Spring",
	"title": "Object Oriented Software Design",
	"topics": [
		"Projects implemented in Java and C++",
		"Unified Modeling Language (UML)",
		"OO Design Principles \u0026 Implementation",
		"Design Patterns (Supplemented by Gang of Four)",
		"Design Methodology"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62b7e0e95d600547f6d3f3"
	},
	"description": "This  course  provides  an  introduction  to  the  field  of  Natural  Language  Processing.  It  includes  relevant background material in Linguistics, Mathematics, Probabilities, and Computer Science. Some of the topics covered  in  the  class  are  Text  Similarity,  Part  of  Speech  Tagging,  Parsing,  Semantics,  Question  Answering, Sentiment Analysis, and Text Summarization.",
	"year": "2018",
	"semester": "Spring",
	"title": "Natural Language Processing",
	"topics": [
		"Text Similarity",
		"Part of Speech Tagging",
		"Parsing",
		"Semantics",
		"Question and Answering",
		"Sentiment Analysis",
		"Text Summarization",
		"Cosine Similarity",
		"Bag of Words Retrieval Model"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62b8dee95d600547f6d3f4"
	},
	"description": "This course deals with the principles of data mining. Topics covered include machine learning methods, knowledge discovery and representation, classification and prediction models.",
	"year": "2018",
	"semester": "Spring",
	"title": "Machine Learning and Data Mining",
	"topics": [
		"Decision Trees",
		"Classification Rule Sets",
		"Data Cleaning"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62be83e95d600547f6d3f5"
	},
	"description": "The students will work together in the team environment to bring the project to completion. This will involve the use of engineering analysis and design methodologies. The course will improve their team participation and management skills, along with their written and oral communication skills. It will make the students aware of both safety and environmental issues.\n\nI worked with an electrical engineering and mechanical engineering undergraduate over a 2 semester period. We designed, implemented, and demo'd a Pick and Place system capable of picking up and placing surface mount components onto PCB boards. My primary responsibility was the implementation of the PC Interface, required to allow users to communicate with the machine's embedded system. Through the system's PC Interface, parts are defined and PCB designs are uploaded, allowing the system to perform batch jobs and autonomously place parts. The PC interface also provides part position error checking and auto-correcting through an open source computer vision library, OpenCV.",
	"year": "2016",
	"semester": "Fall",
	"title": "Senior Engineering Design",
	"topics": [
		"Java user interface - model view controller design",
		"USB communication between PC and Pick and Place embedded system",
		"Manual jog controls",
		"Batch job scheduling",
		"Computer vision with OpenCV and Python - detects part placement error and auto-corrects through feedback loop"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c173e95d600547f6d3f6"
	},
	"description": "By the end of the course students will be able to have an understanding of Artificial Intelligence methodologies and be able to apply these techniques to solving difficult problems.",
	"year": "2016",
	"semester": "Fall",
	"title": "Intro Artificial Intelligence",
	"topics": [
		"Overview of fundamental concepts of Artificial Intelligence",
		"Uninformed search including DFS, BFS, IDS",
		"Informed search with heuristics including A* search and IDA* search",
		"Min-max search",
		"Alpha beta pruning",
		"Knowledge representation",
		"Connectionist systems including Artificial Neural Networks",
		"Philosophical issues relating to both computational and human intelligence"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c1b2e95d600547f6d3f7"
	},
	"description": "This course introduces the mathematical notations, tools, and techniques used in algorithm analysis. You will study various algorithms for sorting, searching, and graph-based problems. You will study the algorithms in general and will analyze the algorithm run-time. ",
	"year": "2016",
	"semester": "Spring",
	"title": "Design/Analysis of Algorithms",
	"topics": [
		"Foundations: Growth of Functions, Summations and Recurrences",
		" Sorting: Heapsort, Quicksort, Sorting in Linear Time",
		"Basic Data Structures",
		" Dynamic Programming: Matrix-Chain Multiplication, Longest Common Subsequence ",
		"Greedy Algorithms: Activity-Selection Problem, Huffman Codes ",
		"Graph algorithms: Elementary Graph Algorithms, MST, Single-Source Shortest Paths "
	],
	"__v": 1
},
{
	"_id": {
		"$oid": "5a62c28be95d600547f6d3f8"
	},
	"description": "An introduction to the formal languages and automata, with emphasis on context-free and regular languages. Topics will include regular grammars, deterministic and nondeterministic finite state machines, parsing algorithms, linear-bounded automata and the use of Turing machines to introduce the P/NP problem.",
	"year": "2016",
	"semester": "Spring",
	"title": "Formal Lang \u0026 Automata",
	"topics": [
		"Introduction to the Theory of Computation",
		"Finite Automata",
		"Regular Languages and Regular Grammars",
		"Properties of Regular Languages",
		"Context-Free Languages",
		"Simplifications of Context-Free Grammars and Normal Forms",
		"Turing Machines",
		"Hierarchy of Formal Languages and Automata"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c2f4e95d600547f6d3f9"
	},
	"description": "A system level software and hardware integration from design concepts to practical implementation covering both analog and digital signal conditioning and interface. ",
	"year": "2015",
	"semester": "Fall",
	"title": "Intro Embedded Systems",
	"topics": [
		"Serial communication with I/O devices",
		"Parallel communication with I/O devices",
		"Motor interface",
		"Robotics interface ",
		"Writing drivers for various peripheral devices"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c33ce95d600547f6d3fa"
	},
	"description": "An introduction to the basic principles and practices of software engineering. Emphasis will be placed on programming language support for software engineering principles, especially techniques for data abstraction, code reusability and \"programming in the large\". Other topics include software life-cycle models; general design, Implementation, and testing issues; specification and design methodologies; and model-based approaches to software design. Students will complete a team project involving written and oral presentations.",
	"year": "2015",
	"semester": "Fall",
	"title": "Principles Software Engineering",
	"topics": [
		""
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c3aae95d600547f6d3fb"
	},
	"description": "Architecture of a 16-bit microprocessor; addressing modes, instruction set, assembly and C language programming, program design, hardware model, exception handling and interface to memory and peripherals. Training kits will be used in the lab to run assembly and C programs.",
	"year": "2015",
	"semester": "Spring",
	"title": "Intro Microprocessor Systems",
	"topics": [
		"Introduction to the MSP 430",
		"Introduction to assembly language",
		"Digital input and output",
		"Interrupts",
		"Timers",
		"Mixed signal processing"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c42de95d600547f6d3fc"
	},
	"description": "This course will provide students with an in-depth understanding\nof the theory, operation and application of modern database systems. At the end of the class,\nstudents should be able to master concepts of DBMS design, relational model, indexing\ntechniques, etc. Students will apply SQL programming language to perform relational database\noperations. Presentations will be given by students to discuss their projects. Students will use\nMySQL database systems to design and develop a database application. ",
	"year": "2015",
	"semester": "Spring",
	"title": "Intro Database Structures",
	"topics": [
		"DBMS Design, ER Model ",
		"Relational Mode",
		"SQL",
		"File Organization and Storage ",
		"Indexing Techniques",
		"Transaction Management",
		"Concurrency \u0026 Crash Recovery ",
		"Normalization"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c586e95d600547f6d3fe"
	},
	"description": "The purpose of this course is\u0009to teach students how to design and develop websites and\u0009web-based applications using contemporary tools and standards. This course is project-oriented. Students will develop hands-on knowledge of some\u0009of the latest web development tools, languages and frameworks, and use that knowledge to complete several web-based projects.",
	"year": "2014",
	"semester": "Fall",
	"title": "Intro Internet Computing",
	"topics": [
		"Web\u0009design and development today",
		"HTML 5",
		"CSS",
		"JavaScript",
		"jQuery",
		"AJAX",
		"PHP",
		"MySQL"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c659e95d600547f6d3ff"
	},
	"description": "This course provides an introduction to fundamental concepts in the design of data communications networks, networking protocols, and applications. Topics to be covered include network architectures, physical media, protocols for data link, network, transport, and application layers. Students acquire hands on experience programming TCP/IP network applications and using an packet-driven network simulator.",
	"year": "2014",
	"semester": "Spring",
	"title": "Intro Data Communications",
	"topics": [
		"Network models",
		"Data and signals",
		"Digital \u0026 analog transmission",
		"Multiplexing and switching",
		"OPNET IT Guru network simulator",
		"Link layer basics",
		"Wired/wireless LANs",
		"Connecting LANs, backbone networks, VLANs",
		"Network layer: logical addressing and Internet Protocol",
		"Network layer: delivery, forwarding, routing",
		"Transport layer: UDP and TCP",
		"DNS and WWW"
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "5a62c6d1e95d600547f6d401"
	},
	"description": "Brief introduction to Java; software development process; functional specification and use cases; Unified Modeling Language diagrams; design methodology; OO design principles; implementation in Java; design patterns; Java applet framework; advanced Java topics: reflection, serialization, multithreading, generics.",
	"year": "2014",
	"semester": "Spring",
	"title": "Object Oriented Programming",
	"topics": [
		"Java",
		"Object oriented design process",
		"Class design",
		"Interfaces and polymorphism",
		"Patterns and GUI programming",
		"Inheritance and abstract classes",
		"Java Object Model",
		"Frameworks",
		"Multithreading"
	],
	"__v": 0
}]

